[{"bodyPart":"waist","equipment":"body weight","gifUrl":"https://v2.exercisedb.io/image/UcvY9fRgNeiV4m","id":"0001","name":"3/4 sit-up","target":"abs","secondaryMuscles":["hip flexors","lower back"],"instructions":["Lie flat on your back with your knees bent and feet flat on the ground.","Place your hands behind your head with your elbows pointing outwards.","Engaging your abs, slowly lift your upper body off the ground, curling forward until your torso is at a 45-degree angle.","Pause for a moment at the top, then slowly lower your upper body back down to the starting position.","Repeat for the desired number of repetitions."]},{"bodyPart":"waist","equipment":"body weight","gifUrl":"https://v2.exercisedb.io/image/I-Of0Ev43i4Zt7","id":"0002","name":"45° side bend","target":"abs","secondaryMuscles":["obliques"],"instructions":["Stand with your feet shoulder-width apart and your arms extended straight down by your sides.","Keeping your back straight and your core engaged, slowly bend your torso to one side, lowering your hand towards your knee.","Pause for a moment at the bottom, then slowly return to the starting position.","Repeat on the other side.","Continue alternating sides for the desired number of repetitions."]},{"bodyPart":"waist","equipment":"body weight","gifUrl":"https://v2.exercisedb.io/image/vqnn-xmm4fINTJ","id":"0003","name":"air bike","target":"abs","secondaryMuscles":["hip flexors"],"instructions":["Lie flat on your back with your hands placed behind your head.","Lift your legs off the ground and bend your knees at a 90-degree angle.","Bring your right elbow towards your left knee while simultaneously straightening your right leg.","Return to the starting position and repeat the movement on the opposite side, bringing your left elbow towards your right knee while straightening your left leg.","Continue alternating sides in a pedaling motion for the desired number of repetitions."]},{"bodyPart":"waist","equipment":"body weight","gifUrl":"https://v2.exercisedb.io/image/Y99VpeCGG19urP","id":"0006","name":"alternate heel touchers","target":"abs","secondaryMuscles":["obliques"],"instructions":["Lie flat on your back with your knees bent and feet flat on the ground.","Extend your arms straight out to the sides, parallel to the ground.","Engaging your abs, lift your shoulders off the ground and reach your right hand towards your right heel.","Return to the starting position and repeat on the left side, reaching your left hand towards your left heel.","Continue alternating sides for the desired number of repetitions."]},{"bodyPart":"waist","equipment":"body weight","gifUrl":"https://v2.exercisedb.io/image/syexFkqm09g-Ms","id":"2355","name":"arm slingers hanging bent knee legs","target":"abs","secondaryMuscles":["shoulders","back"],"instructions":["Hang from a pull-up bar with your arms fully extended and your knees bent at a 90-degree angle.","Engage your core and lift your knees towards your chest, bringing them as close to your elbows as possible.","Slowly lower your legs back down to the starting position.","Repeat for the desired number of repetitions."]},{"bodyPart":"waist","equipment":"body weight","gifUrl":"https://v2.exercisedb.io/image/Sv6SbN1kjlv7cR","id":"2333","name":"arm slingers hanging straight legs","target":"abs","secondaryMuscles":["shoulders","back"],"instructions":["Hang from a pull-up bar with your arms fully extended and your legs straight down.","Engage your core and lift your legs up in front of you until they are parallel to the ground.","Hold for a moment at the top, then slowly lower your legs back down to the starting position.","Repeat for the desired number of repetitions."]},{"bodyPart":"waist","equipment":"body weight","gifUrl":"https://v2.exercisedb.io/image/hcbbkHUzwGrwny","id":"3204","name":"arms overhead full sit-up (male)","target":"abs","secondaryMuscles":["hip flexors","lower back"],"instructions":["Lie flat on your back with your knees bent and feet flat on the ground.","Extend your arms overhead, keeping them straight.","Engaging your abs, slowly lift your upper body off the ground, curling forward until your torso is upright.","Pause for a moment at the top, then slowly lower your upper body back down to the starting position.","Repeat for the desired number of repetitions."]},{"bodyPart":"waist","equipment":"assisted","gifUrl":"https://v2.exercisedb.io/image/AZb8RmkBQvPpqG","id":"0011","name":"assisted hanging knee raise","target":"abs","secondaryMuscles":["hip flexors"],"instructions":["Hang from a pull-up bar with your arms fully extended and your palms facing away from you.","Engage your core muscles and lift your knees towards your chest, bending at the hips and knees.","Pause for a moment at the top of the movement, squeezing your abs.","Slowly lower your legs back down to the starting position.","Repeat for the desired number of repetitions."]},{"bodyPart":"waist","equipment":"assisted","gifUrl":"https://v2.exercisedb.io/image/LGGn33YGqbqkKG","id":"0010","name":"assisted hanging knee raise with throw down","target":"abs","secondaryMuscles":["hip flexors","lower back"],"instructions":["Hang from a pull-up bar with your arms fully extended and your palms facing away from you.","Engage your core and lift your knees towards your chest, keeping your legs together.","Once your knees are at chest level, explosively throw your legs down towards the ground, extending them fully.","Allow your legs to swing back up and repeat the movement for the desired number of repetitions."]},{"bodyPart":"waist","equipment":"assisted","gifUrl":"https://v2.exercisedb.io/image/7rVuOzzhMo3qnN","id":"0012","name":"assisted lying leg raise with lateral throw down","target":"abs","secondaryMuscles":["hip flexors","obliques"],"instructions":["Lie flat on your back with your legs extended and your arms by your sides.","Place your hands under your glutes for support.","Engage your abs and lift your legs off the ground, keeping them straight.","While keeping your legs together, lower them to one side until they are a few inches above the ground.","Pause for a moment, then lift your legs back to the starting position.","Repeat the movement to the other side.","Continue alternating sides for the desired number of repetitions."]}]